Documents/ПриобретениеАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриобретениеАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенег</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиВалюты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаЕдиницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПриобретениеАктива/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура АктивПриИзменении(Элемент)
    // Вызываем серверную функцию, чтобы получить данные актива
	ДанныеАктива = ПолучитьДанныеАктиваНаСервере(Объект.Актив);
	
	Если ДанныеАктива <> Неопределено Тогда
		Объект.Валюта = ДанныеАктива.Валюта;
		
		// Устанавливаем пользователя из актива
		Объект.Пользователь = ДанныеАктива.Пользователь;
		// Сразу после установки валюты обновляем курс (ваша прошлая процедура)
		ЗаполнитьКурсНаСервере();
	КонецЕсли;
    ПересчитатьСумму();
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьДанныеАктиваНаСервере(СсылкаНаАктив)
	
	Если СсылкаНаАктив.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Создаем структуру и наполняем её данными из справочника
	Результат = Новый Структура;
	Результат.Вставить("Валюта",      СсылкаНаАктив.Валюта);
	Результат.Вставить("Пользователь", СсылкаНаАктив.Пользователь);
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
    ПересчитатьСумму();
    ЗаполнитьКурсНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
    ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаЗаЕдиницуПриИзменении(Элемент)
    ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
    ЗаполнитьКурсНаСервере();
    ПересчитатьСумму();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютуАктиваНаСервере()
    
    Если Объект.Актив = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Подставляем валюту актива как валюту цены по умолчанию
    Если Объект.Валюта = Неопределено Тогда
        Объект.Валюта = Объект.Актив.Валюта;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсНаСервере()
    
    // 1. Проверка на заполнение валюты
    Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
        Объект.Курс = 1;
        Возврат;
    КонецЕсли;
    
    // 2. Проверка на рубли (код "RUB")
    Если СокрЛП(Объект.Валюта.Код) = "RUB" Тогда
        Объект.Курс = 1;
        Возврат;
    КонецЕсли;
    
    // 3. Запрос только по полю Курс
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ

    |	КурсыВалютСрезПоследних.Курс КАК Курс
    |ИЗ
    |	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
    
    // Если дата документа не заполнена, берем текущую
    РабочаяДата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
    
    Запрос.УстановитьПараметр("Период", РабочаяДата);
    Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
    
    Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Объект.Курс = Выборка.Курс;
    Иначе
        // Если курса в базе нет вообще
        Объект.Курс = 1;
    КонецЕсли;
    
КонецПроцедуры
&НаКлиенте
Процедура ПересчитатьСумму()
    
    Если Объект.Количество > 0 И Объект.ЦенаЗаЕдиницу > 0 Тогда
        Объект.Сумма = Объект.Количество * Объект.ЦенаЗаЕдиницу;
    Иначе
        Объект.Сумма = 0;
    КонецЕсли;
    
КонецПроцедуры
